## Plan Result (prod_global)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;child-adoption&#34;]
* Update
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;child-adoption&#34;]
  * module.landing_zone[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["child-adoption"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/child-adoption"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "apply-to-adopt-a-child-placed-in-your-care-service-gov-uk"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect["child-adoption"] will be updated in-place
  ~ resource "azurerm_frontdoor_custom_https_configuration" "https_www_redirect" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/customHttpsConfiguration/wwwchild-adoption"
        # (2 unchanged attributes hidden)

      ~ custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "apply-to-adopt-a-child-placed-in-your-care-service-gov-uk"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod"
          ~ certificate_source                      = "FrontDoor" -> "AzureKeyVault"
            # (3 unchanged attributes hidden)
        }
    }

  # module.landing_zone[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1851,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->